import Taro, { Component } from '@tarojs/taro';
import { View } from '@tarojs/components';

const JDate = (p)=> <View></View>;
const JDateDiff = (p)=> <View></View>;
const JDateLapse = (p)=> <View></View>;
const JCountDown = (p)=> <View></View>;

export default class Index extends Component {
    render () {
        return (
            <View>

                {/* 
                ---------------------------------------------------------------------------------------
                 时间： 输入时间戳，或时间字符串，输出指定格式的时间文本
                ---------------------------------------------------------------------------------------
                 @param {number | string} date 时间戳，或时间字符串。默认：“当前时间戳”
                 @param {string} format 时间格式字符串，通常会使用config配置项。默认：“Y-m-d H:i:s”
                 @return <Text></Text>
                ---------------------------------------------------------------------------------------
                */}
                <JDate 
                    date='' 
                    format=''
                ></JDate>

                {/* 
                ---------------------------------------------------------------------------------------
                 时差： 分别输入开始和结束时间戳，或时间字符串，计算2个时间的间隔绝对值。输出指定格式的时间文本
                ---------------------------------------------------------------------------------------
                 @param {number | string} dateStart 开始时间戳，或时间字符串。默认：“当前时间戳”
                 @param {number | string} dateEnd 结束时间戳，或时间字符串。默认：“当前时间戳”
                 @param {string} format 时间格式字符串，通常会使用config配置项。默认：“Y-m-d H:i:s”
                 @return <Text></Text>
                ---------------------------------------------------------------------------------------
                */}
                <JDateDiff 
                    dateStart='' 
                    dateEnd='' 
                    format=''
                ></JDateDiff>

                {/* 
                ---------------------------------------------------------------------------------------
                 已流逝： 输入一个时间戳，或时间字符串，输出时间已流逝的日常用语文本（如：刚刚，一小时前等等）
                ---------------------------------------------------------------------------------------
                 @param {number | string} date 时间戳，或时间字符串。默认：“当前时间戳”
                 @return <Text></Text>
                ---------------------------------------------------------------------------------------
                */}
                <JDateLapse 
                    date=''
                ></JDateLapse>

                {/* 
                ---------------------------------------------------------------------------------------
                 倒计时： 输入一个时间戳，或时间字符串，进行倒计时操作，并自行接受日、时、分、秒，进行自定义显示
                ---------------------------------------------------------------------------------------
                 @param {number | string} date 时间戳，或时间字符串。默认：“当前时间戳”
                 @param {JSX} d 倒计时中，输出天数的jsx
                 @param {JSX} h 倒计时中，输出小时的jsx
                 @param {JSX} i 倒计时中，输出小时的jsx
                 @param {JSX} s 倒计时中，输出秒的jsx
                 @return <View></View>
                ---------------------------------------------------------------------------------------
                */}
                <JCountDown
                    date=''
                    d={(d)=> <View>{d}</View>}
                    h={(h)=> <View>{h}</View>}
                    i={(i)=> <View>{i}</View>}
                    s={(s)=> <View>{s}</View>}
                ></JCountDown>

            </View>
        );
    }
}
